---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.EndsNotOnEdgeError
source: html/06d542ee-8006-582f-3eb2-2091438b855e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.EndsNotOnEdgeError Property

Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.

## Syntax (C#)
```csharp
public static FailureDefinitionId EndsNotOnEdgeError { get; }
```